# SVM 准确率

from pylab import mpl
import matplotlib.pyplot as plt

# 2.Adaboost的50次迭代过程错误率
from pylab import mpl
import matplotlib.pyplot as plt
import numpy as np
mpl.rcParams['font.sans-serif'] = ['SimHei']
x = [i for i in range(1, 51)]
array = [0.270000, 0.200000, 0.170000, 0.190000, 0.170000, 0.160000, 0.190000, 0.160000, 0.180000, 0.180000, 0.170000,
         0.160000, 0.180000, 0.170000, 0.180000, 0.170000, 0.170000, 0.160000, 0.190000, 0.170000, 0.170000, 0.170000,
         0.170000, 0.170000, 0.190000, 0.160000, 0.170000, 0.170000, 0.180000, 0.170000, 0.180000, 0.160000, 0.170000,
         0.180000, 0.180000, 0.160000, 0.180000, 0.160000, 0.180000, 0.180000, 0.170000, 0.160000, 0.180000, 0.170000,
         0.180000, 0.170000, 0.170000, 0.160000, 0.190000, 0.170000]
plt.plot(x, array,label="错误率")
plt.xlabel("次数")
plt.ylabel("错误率")
plt.xlim(0.5,50)
plt.title("AdaBoost二分类错误率")
plt.show()
